import 'package:flutter/material.dart';

import 'bhajans.dart';

void main() {
  runApp(const MyApp());
}

class MyApp extends StatelessWidget {
  const MyApp({super.key});

  // This widget is the root of your application.
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      title: 'ZITI Assignment',
      theme: ThemeData(
        primarySwatch: Colors.deepOrange,
      ),
      home: const MyHomePage(
        title: 'ZITI Assignment',
      ),
    );
  }
}

class MyHomePage extends StatefulWidget {
  const MyHomePage({super.key, required this.title});
  final String title;

  @override
  State<MyHomePage> createState() => _MyHomePageState();
}

class _MyHomePageState extends State<MyHomePage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(widget.title),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(16.0),
          child: Column(
            mainAxisAlignment: MainAxisAlignment.center,
            crossAxisAlignment: CrossAxisAlignment.start,
            children: <Widget>[
              const Text(
                "1528 से 2024 तक की कहानी, इतिहास के पन्नों में दर्ज हैं राम जन्मभूमि से जुड़े किस्से",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              Image.asset("images/Ram_mandir_1.jpg"),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """अयोध्या नगरी कितनी पुरानी है क्या आपको इसका अंदाजा है? भारतीय वेदों और शास्त्रों में भी अयोध्या का जिक्र मिलता है। अथर्ववेद में भी इस नगरी का साक्ष्य मिलता है। हमारी मान्यताओं में अयोध्या नगरी हमेशा से ही श्री राम की जन्मभूमि रही है। अयोध्या का धार्मिक इतिहास तो हमने रामायण में पढ़ा है, लेकिन इसके इतिहास का एक पन्ना विवादित भी है। हम बात कर रहे हैं बाबरी मस्जिद और इससे जुड़ी घटनाओं की। इस वक्त पूरा भारत श्रीराम की मूर्ति की प्राण-प्रतिष्ठा को लेकर खुशियों में सराबोर है। ऐसे में क्यों ना इतिहास के गलियारों में एक बार घूम लिया जाए।
आज हम उन तारीखों की बात करते हैं, जिन्होंने मौजूदा समय में राम मंदिर का स्वरूप निर्धारित करने में मदद की है। अधिकतर लोगों को लगता है कि यह विवाद 70 सालों से चला आ रहा है, लेकिन इसकी नींव असल में 16वीं सदी में ही रख दी गई थी। हालांकि, उससे पहले भी अयोध्या नगरी में मंदिर और मस्जिद के विवाद रहे हैं, लेकिन आधुनिक इतिहास को हम साल 1528 से ही देख सकते हैं।""",
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1528-29 के बीच बनाई गई थी बाबरी मस्जिद",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """अयोध्या का विवाद बाबरी मस्जिद से घिरा हुआ है। इसकी शुरुआत हुई साल 1528 में जब बाबर के सेनापति मीर बाकी ने अयोध्या में बाबरी मस्जिद बनवाया। इस मस्जिद को मुगल काल की एक महत्वपूर्ण मस्जिद माना जाता था। वैसे बाबरी मस्जिद का मॉर्डन दस्तावेजों में भी जिक्र है, जैसे साल 1932 में छपी किताब 'अयोध्या: ए हिस्ट्री' में भी बताया गया है कि मीर बाकी को बाबर ने ही हुक्म दिया था कि अयोध्या में राम जन्मभूमि है और यहां के मंदिर को तोड़कर मस्जिद का निर्माण करवाना होगा।""",
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              Image.asset("images/ram_mandir_2.jpg"),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """बाबर के सिपाही द्वारा बनाई गई इस मस्जिद का नाम बाबरी रख दिया गया। हालांकि, इसे लेकर अभी भी विवाद है कि बाबरी मस्जिद को मंदिर तोड़कर ही बनाया गया था, लेकिन कई किताबें इसका जिक्र जरूर करती हैं कि मंदिर की सामग्री से ही मस्जिद का निर्माण शुरू किया गया था। उस वक्त क्या हुआ था इसे लेकर कई दावे मिलते हैं।""",
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "300 साल बाद शुरू हुआ विवाद",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """मस्जिद के बनने के 300 साल बाद इसे लेकर विवाद की पहली झलक दिखाई दी। अब जो इतिहास शुरू होने वाला था वह लंबी लड़ाई के साथ-साथ विध्वंस की कहानी कहने वाला था।

1853 से 1855 के बीच में अयोध्या के मंदिरों को लेकर विवाद शुरू होने लगे। Indian history collective की रिपोर्ट बताती है कि उस वक्त सुन्नी मुसलमानों के एक गुट ने हनुमानगढ़ी मंदिर पर हमला कर दिया था। उनका दावा था कि यह मंदिर मस्जिद को तोड़कर बनाया गया है। हालांकि, इसका कोई भी साक्ष्य नहीं मिला।  

सर्वपल्ली गोपाल की किताब 'एनाटॉमी ऑफ अ कन्फ्रंटेशन: अयोध्या एंड द राइज ऑफ कम्युनल पॉलिटिक्स इन इंडिया' में भी इसका जिक्र है। किताब में यह भी कहा गया है कि उस वक्त हनुमानगढ़ी मंदिर बैरागियों के अधीन था और उन्होंने आसानी से मुसलमानों के गुट को हटा दिया था। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              Image.asset("images/ram_mandir_3.jpg"),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """तत्कालीन नवाब वाजिद अली शाह से इसके बारे में शिकायत भी की गई। अयोध्या तब नवाबों के अधीन थी और इस मामले को सुलझाने के लिए कमेटी बनाई गई। उस कमेटी की जांच रिपोर्ट में सामने आया कि वहां कोई भी मस्जिद था ही नहीं। उस वक्त नवाब वाजिद अली शाह ने हनुमानगढ़ी मंदिर पर एक और हमला रोका था। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "अंग्रेजी सरकार ने की सुलह की कोशिश ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """एक रिपोर्ट कहती है कि साल 1858 में निहंग सिखों के एक दल ने बाबरी मस्जिद के अंदर घुसकर हवन-पूजन किया था। उस वक्त इस घटना के खिलाफ पहली बार एफआईआर की गई थी और लिखित में यह विवाद सामने आया था। उसमें लिखा गया था कि अयोध्या में मस्जिद की दीवारों पर राम का नाम लिख दिया गया है और उसके बगल में एक चबूतरा बना है। 

साल 1859 में अंग्रेजी सरकार ने इसके बीच एक दीवार खड़ी कर दी, जिससे हिंदू पक्ष और मुस्लिम पक्ष शांति से अलग-अलग स्थान पर पूजा और इबादत कर सकें। यहीं से पहली बार राम चबूतरा शब्द प्रचलन में आया था। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल सन 1885 में पहली बार कोर्ट पहुंचे थे राम लला ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """Supreme Court Observer (SCO) की रिपोर्ट बताती है कि यह पहली बार था जब राम मंदिर विवाद कोर्ट पहुंचा था। 

यहां महंत रघुवीर दास ने राम चबूतरे पर मंदिर बनवाने की याचिका दायर की थी। फैजाबाद डिस्ट्रिक्ट मजिस्ट्रेट ने यह याचिका खारिज कर दी थी, तब फैजाबाद कोर्ट में रघुवीर दास की याचिका गई थी। उस वक्त केस की सुनवाई कर रहे जज पंडित हरि किशन ने इस याचिका को रद्द कर दिया था। 

उस वक्त पहली बार निर्मोही अखाड़ा सामने आया था और लोगों को उसके बारे में पता चला था। महंत रघुवीर दास उसी अखाड़े से थे। 

इसके बाद भी रघुवीर दास ने हार नहीं मानी और अंग्रेजी सरकार के जज से गुहार लगाई, लेकिन यहां भी याचिका को खारिज कर दिया गया। 

यह मामला यहीं दब गया और अगले 48 सालों तक मामला ठंडे बस्ते में रहा और छुट-फुट शांतिपूर्ण विरोध होते रहे।""",
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1930 का दौर, जब शुरू हुआ अयोध्या का नया अध्याय ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """सबसे पहले साल 1936 में मुसलमानों के दो समुदाय शिया और सुन्नी की लड़ाई हुई। दोनों ही बाबरी मस्जिद पर अपना हक जता रहे थे। इसकी बात दोनों समुदायों के वक्फ बोर्ड तक पहुंची और दोनों की लड़ाई 10 साल तक खिंच गई। इस लड़ाई में जज द्वारा जो फैसला आया उसमें शिया समुदाय के दावों को खारिज कर दिया गया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              Image.asset("images/ram_mandir_4.jpg"),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1947 के बाद से बदल गई अयोध्या की राजनीति ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """मॉर्डन समय में जब भी अयोध्या की बात होती है, तो उसमें राजनीति शब्द जरूर सामने आता है। हालांकि, इसकी शुरुआत बंटवारे के बाद ही हुई। पाकिस्तान का वजूद बना और अयोध्या में अब हिंदू महासभा का हस्तक्षेप सामने आया। 

कृष्णा झा और धीरेन्द्र के झा की किताब 'अयोध्या- द डार्क नाइट' सहित कई किताबें इस बारे में कहती हैं कि 1947 का अंत होते-होते हिंदू महासभा द्वारा एक मीटिंग रखी गई थी जिसमें बाबरी मस्जिद पर कब्जे की बात कही गई थी। इसके बाद के चुनावों में पहली बार कांग्रेस पार्टी ने राम मंदिर को मुद्दा बनाया था। 

कांग्रेस के इस मुद्दे के बाद कोई और पार्टी  कहीं टिक नहीं पाई और फैजाबाद में भी कांग्रेस जीत गई। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1949 में बाबरी मस्जिद में मिली राम लला की मूर्ति ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """अब तक हालात काफी खराब हो चुके थे। गाहे-बगाहे खबरें आती रही कि हिंदू पक्ष ने बाबरी मस्जिद पर कब्जा कर लिया है, लेकिन तब तक ऐसा नहीं हुआ था। वहां के हालात को सुधारने के लिए कानूनी मदद ली गई, लेकिन साल 1949 की एक रात वहां राम मूर्ति मिलने का दावा किया गया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              Image.asset("images/ram_mandir_5.jpg"),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """इस घटना के बाद हालात इतने गंभीर हो गए कि तत्कालीन प्रधानमंत्री जवाहरलाल नेहरू ने संज्ञान लिया। महज 6 दिनों के अंदर ही बाबरी मस्जिद पर ताला लगा दिया गया। उस वक्त हिंदू पक्ष ने दावा किया था कि राम लला की मूर्ति अपने- आप वहां प्रकट हुई है, लेकिन इस दावे को खारिज कर दिया गया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1950 में एक बार फिर से किया गया केस ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """दो अलग-अलग केस फैजाबाद कोर्ट में दाखिल किए गए और हिंदू पक्ष ने रामलला की पूजा की आज्ञा मांगी। हालांकि, कोर्ट ने इजाजत तो दे दी, लेकिन अंदरूनी गेट को बंद ही रखा गया। 

साल 1959 में निर्मोही अखाड़े ने एक तीसरा लॉ सूट फाइल किया, जिसमें उन्होंने बाबरी मस्जिद की जमीन पर अधिकार मांगा। ऐसे ही साल 1961 में मुस्लिम पक्ष ने एक केस फाइल किया जिसमें यूपी सुन्नी वक्फ बोर्ड ने कहा कि उन्हें बाबरी मस्जिद ढांचे पर हक चाहिए और राम की मूर्तियों को यहां से हटा दिया जाना चाहिए। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1984 से एक बार फिर से गरमाया राम जन्मभूमि का विवाद  ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """इस समय अयोध्या ने अपना सबसे बड़ा राजनीतिक दौर देखा। यह वक्त था, जब राम मंदिर आंदोलन की शुरुआत हुई थी। इसी समय बीजेपी के वरिष्ठ नेता लाल कृष्ण आडवाणी को इस आंदोलन का नेतृत्व करने के लिए चुना गया था। 

साल 1986 में राजीव गांधी सरकार के आदेश पर बाबरी मस्जिद के अंदर का गेट खोला गया। दरअसल, उस वक्त लॉयर यूसी पांडे ने फैजाबाद सेशन कोर्ट में याचिका दायर की थी कि फैजाबाद सिटी एडमिनिस्ट्रेशन ने इसका गेट बंद करने का फैसला सुनाया था, इसलिए इसे खोला जाना चाहिए। तब हिंदू पक्ष को यहां पूजा और दर्शन की अनुमति भी दे दी गई और बाबरी मस्जिद एक्शन कमेटी ने इसके खिलाफ प्रोटेस्ट भी किया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1989 में रखी गई थी राम मंदिर की नींव",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """उस समय तत्कालीन प्रधानमंत्री राजीव गांधी ने विश्व हिंदू परिषद को विवादित जगह पर शिलान्यास करने की अनुमति दे दी थी। इसके बाद, पहली बार रामलला का नाम इलाहाबाद हाई कोर्ट पहुंचा था, जिसमें निर्मोही अखाड़ा (1959) और सुन्नी वक्फ बोर्ड (1961) ने रामलला जन्मभूमि पर अपना दावा पेश किया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              Image.asset("images/ram_mandir_6.jpg"),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """साल 1990 में लाल कृष्ण आडवाणी ने गुजरात के सोमनाथ मंदिर से लेकर अयोध्या तक रथ यात्रा की शुरुआत की। यह बहुत ही विवादित दौर था। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 1992 में गिराई गई बाबरी मस्जिद  ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """6 दिसंबर 1992 का वो दिन जब बाबरी मस्जिद को गिराया गया था। भारत के इतिहास में यह दिन दर्ज है। कारसेवकों ने यहां एक अस्थाई मंदिर की स्थापना भी कर दी थी। 

मस्जिद गिराने के 10 दिन बाद प्रधानमंत्री ने रिटायर्ड हाई कोर्ट जस्टिस एम.एस. लिब्रहान को लेकर एक कमेटी बनाई, जिसमें मस्जिद को गिराने और सांप्रदायिक दंगों को लेकर एक रिपोर्ट बनानी थी।  

जनवरी 1993 आते-आते अयोध्या की जमीन को नरसिम्हा राव की सरकार ने अपने अधीन ले लिया और 67.7 एकड़ जमीन को केंद्र सरकार की जमीन घोषित कर दिया गया। 

साल 1994 में इस्माइल फारूकी जजमेंट आया, जिसमें सुप्रीम कोर्ट SC ने 3:2 के बहुमत से अयोध्या में कुछ क्षेत्रों के अधिग्रहण अधिनियम की संवैधानिकता को बरकरार रखा। इस जजमेंट में यह भी कहा गया था कि कोई भी धार्मिक जगह सरकारी हो सकती है। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 2002 में बढ़ने लगी राम मंदिर की मांग",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """अप्रैल 2002 में अयोध्या टाइटल डिस्प्यूट शुरू हुआ और इलाहाबाद हाई कोर्ट की लखनऊ बेंच में हियरिंग शुरू हुई। 

अगस्त 2003 में ASI (आर्कियोलॉजिकल सर्वे ऑफ इंडिया) ने मस्जिद वाली जगह पर खुदाई शुरू की और यह दावा किया कि इसके नीचे 10वीं सदी के मंदिर के साक्ष्य मिले हैं। 

साल 2009 में अपने गठन के 17 सालों बाद लिब्राहन कमीशन ने रिपोर्ट सबमिट की। हालांकि, इस रिपोर्ट में क्या था वह सामने नहीं आया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "30 सितंबर 2010 अयोध्या मामले का ऐतिहासिक फैसला ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """अब तक अयोध्या की जमीन को हर पक्ष अपने लिए मांग रहा था, लेकिन इलाहाबाद हाई कोर्ट ने इस जमीन को तीन हिस्सों में बांट दिया। इसके तहत 1/3 हिस्सा निर्मोही अखाड़ा को, 1/3 हिस्सा सुन्नी वक्फ बोर्ड को और 1/3 हिस्सा राम लला विराजमान को दिया गया। 

इस फैसले ने पूरे देश में विवादों को जन्म दिया। इसके खिलाफ एक बार फिर से याचिका दायर हुई और साल 2011 में सुप्रीम कोर्ट ने इलाहाबाद हाई कोर्ट की रूलिंग को रोक दिया। सुप्रीम कोर्ट ने इस हियरिंग को लेकर कहा कि इलाहाबाद हाई कोर्ट का जजमेंट अजीब है, क्योंकि तीनों में से किसी भी पार्टी ने इसके लिए गुहार नहीं लगाई थी। 

साल 2017 आते-आते चीफ जस्टिस खेहर ने तीनों पार्टियों को आउट ऑफ कोर्ट सेटलमेंट के बारे में कहा। इसपर एक बार फिर से बहस शुरू हुई। 

साल 2018 में सुप्रीम कोर्ट ने अपना फैसला दिया। हालांकि, तो लेकिन उसे जगजाहिर नहीं किया गया। उस वक्त सुप्रीम कोर्ट ने बड़ी बेंच के तहत उनके फैसले की जांच करने को मना कर दिया था। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 2019 में आखिरकार आया ऐतिहासिक फैसला  ",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """चीफ जस्टिस गोगोई ने साल 2019 में 5 जजों की बेंच बनाई और पुराने 2018 वाले फैसले को खारिज कर दिया। 8 मार्च 2019 को दो दिन की सुनवाई के बाद जमीनी विवाद को आपसी सहमति से सुलझाने की बात एक बार फिर से कही गई। 

नवंबर 2019 आते-आते सुप्रीम कोर्ट ने हिंदू पक्ष के हित में फैसला सुनाया और राम मंदिर को एक ट्रस्ट के जरिए बनवाने का आदेश दिया। इसके साथ सुन्नी वक्फ बोर्ड को 5 एकड़ जमीन दी गई, जहां अयोध्या में मस्जिद बनवाया जाना था। दिसंबर तक इस मुद्दे पर कई पिटीशन फाइल की गई और सुप्रीम कोर्ट ने इस मुद्दे को खारिज कर दिया। 

फरवरी 2020 को श्री राम जन्मभूमि तीर्थ क्षेत्र ट्रस्ट की स्थापना हुई। लोकसभा में प्रधानमंत्री नरेंद्र मोदी ने इसकी घोषणा की। 

सुन्नी वक्फ बोर्ड ने 5 एकड़ जमीन को स्वीकार किया और अगस्त 2020 में प्रधानमंत्री नरेंद्र मोदी ने राम मंदिर का शिलान्यास किया। """,
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 2020 में शुरू हुआ राम मंदिर का निर्माण",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """आधिकारिक रूप से शुरू हो गया। 5 फरवरी 2020 को प्रधानमंत्री नरेंद्र मोदी द्वारा राम मंदिर निर्माण के लिए ट्रस्ट बनाया गया। अगस्त 2020 में राम मंदिर की आधारशिला रखी गई।""",
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                "साल 2024 में हुआ राम मंदिर का उद्घाटन",
                style: TextStyle(
                    color: Colors.black,
                    fontSize: 22,
                    fontWeight: FontWeight.bold),
              ),
              const SizedBox(
                height: 10,
              ),
              const Text(
                """आखिरकार, 22 जनवरी 2024 आ गया और इस दिन राम मंदिर में रामलला की प्राण प्रतिष्ठा भी हो गई। अब यह मंदिर आम लोगों के लिए खोल दिया जाएगा और अयोध्या में आकर लोग श्री राम के बाल रूप के दर्शन कर पाएंगे।""",
                style: TextStyle(fontSize: 16),
              ),
              const SizedBox(
                height: 10,
              ),
              Center(
                child: ElevatedButton(
                    style: ElevatedButton.styleFrom(
                        maximumSize: Size(250, 40), minimumSize: Size(250, 40)),
                    onPressed: () {
                      Navigator.push(
                          context,
                          MaterialPageRoute(
                              builder: (BuildContext context) => Bhajans()));
                    },
                    child: Text("Next")),
              )
            ],
          ),
        ),
      ),
    );
  }
}
